---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.DoorCost
source: html/efdf5191-47a5-2d99-db4f-b425edebbee6.htm
---
# Autodesk.Revit.DB.ParameterTypeId.DoorCost Property

"Cost"

## Syntax (C#)
```csharp
public static ForgeTypeId DoorCost { get; }
```